giraydorukyurt7/STM32-Tutorial-Projects/007_1_STDP_TIMER_INTERRUPT/src/main.c
#include "stm32f4xx.h"
#include "stm32f4_discovery.h"

GPIO_InitTypeDef GPIO_InitStruct;
TIM_TimeBaseInitTypeDef TIM_InitStruct;
NVIC_InitTypeDef NVIC_InitStruct;

int count = 0;

void GPIO_Config()
	{
	 RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOD, ENABLE);

	 //Bu structure GPIOA  (D) portuna atandi
	 GPIO_InitStruct.GPIO_Mode		 = GPIO_Mode_OUT;
	 GPIO_InitStruct.GPIO_Pin		 = GPIO_Pin_12 | GPIO_Pin_13 | GPIO_Pin_14 | GPIO_Pin_15;
	 GPIO_InitStruct.GPIO_OType		 = GPIO_OType_PP;
	 GPIO_InitStruct.GPIO_PuPd		 = GPIO_PuPd_NOPULL;
	 GPIO_InitStruct.GPIO_Speed		 = GPIO_Speed_100MHz;

	 GPIO_Init(GPIOD, &GPIO_InitStruct);
}

void TIMER_Config()
{
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM3, ENABLE);

	TIM_InitStruct.TIM_ClockDivision		= TIM_CKD_DIV1;
	TIM_InitStruct.TIM_CounterMode			= TIM_CounterMode_Up;
	TIM_InitStruct.TIM_Period				= 1999;
	TIM_InitStruct.TIM_Prescaler			= 41999;
	TIM_InitStruct.TIM_RepetitionCounter	= 0; //divison-1

	TIM_TimeBaseInit(TIM3, &TIM_InitStruct);

	TIM_ITConfig(TIM3, TIM_IT_Update, ENABLE);

	TIM_Cmd(TIM3, ENABLE);
}

void NVIC_Config()
{
	NVIC_InitStruct.NVIC_IRQChannel 					= TIM3_IRQn;
	NVIC_InitStruct.NVIC_IRQChannelCmd					= ENABLE;
	NVIC_InitStruct.NVIC_IRQChannelPreemptionPriority	= 0x00;
	NVIC_InitStruct.NVIC_IRQChannelSubPriority			= 0x00;

	NVIC_Init(&NVIC_InitStruct);



}

void TIM3_IRQHandler()
{
	GPIO_ToggleBits(GPIOD, GPIO_Pin_12 | GPIO_Pin_13 | GPIO_Pin_14 | GPIO_Pin_15);

	TIM_ClearITPendingBit(TIM3, TIM_IT_Update);
}

int main(void)
{
	TIMER_Config();
	GPIO_Config();
	NVIC_Config();

	while (1)
	{
		count = TIM_GetCounter(TIM3);

	}
}

void EVAL_AUDIO_TransferComplete_CallBack(uint32_t pBuffer, uint32_t Size)
{
  /* TODO, implement your code here */
  return;
}

uint16_t EVAL_AUDIO_GetSampleCallBack(void)
{
  /* TODO, implement your code here */
  return -1;
}
